-- --------------------------------------------------------
-- 主机:                           127.0.0.1
-- 服务器版本:                        10.2.13-MariaDB - mariadb.org binary distribution
-- 服务器操作系统:                      Win64
-- HeidiSQL 版本:                  9.4.0.5125
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;

-- 正在导出表  cnherb.herb 的数据：~0 rows (大约)
/*!40000 ALTER TABLE `herb` DISABLE KEYS */;
REPLACE INTO `herb` (`id`, `name`, `image`, `descript`) VALUES
	(1, '人参', 'https://gss1.bdstatic.com/-vo3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=c4c360bf9222720e7bcee5fc43f06d7b/bba1cd11728b471074263811c9cec3fdfd0323e6.jpg', '人参（Panax ginseng C. A. Mey）为多年生草本植物，喜阴凉，叶片无气孔和栅栏组织，无法保留水分，温度高于32度叶片会灼伤，郁闭度0.7-0.8。通常3年开花，5-6年结果，花期5-6月，果期6-9月。生长于北纬33度-48度之间的海拔数百米的以红松为主的针阔混交林或落叶阔叶林下，产于中国东北、朝鲜、韩国、日本、俄罗斯东部。人参的别称为黄参、地精、神草、百草之王，是闻名遐迩的“东北三宝”之一。'),
	(2, '甘草', 'https://gss2.bdstatic.com/-fo3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=e729221233dbb6fd255be220311fcc25/c75c10385343fbf204e230caba7eca8064388f09.jpg', '甘草 [1] ，（学名：Glycyrrhiza uralensis Fisch）别名：国老、甜草、乌拉尔甘草、甜根子。豆科、甘草属多年生草本，根与根状茎粗壮，是一种补益中草药。对人体很好的一种药，药用部位是根及根茎，药材性状根呈圆柱形，长25～100厘米，直径0.6～3.5厘米。外皮松紧不一，表面红棕色或灰棕色。根茎呈圆柱形，表面有芽痕，断面中部有髓。气微，味甜而特殊。功能主治清热解毒、祛痰止咳、脘腹等。喜阴暗潮湿，日照长气温低的干燥气候。甘草多生长在干旱、半干旱的荒漠草原、沙漠边缘和黄土丘陵地带。根和根状茎供药用。'),
	(3, '麻黄', 'https://gss1.bdstatic.com/9vo3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=903593aaab014c08193b2fa332406535/574e9258d109b3dee593fa6bcebf6c81800a4c80.jpg', '麻黄是《中国药典》收录的草药，药用来源为 麻黄科植物草麻黄、中麻黄或木贼麻黄的干燥草质茎。秋季采割绿色的草质茎，晒干。其性温，味辛、微苦，有发汗散寒、宣肺平喘、利水消肿的功效，可治疗风寒感冒、胸闷喘咳风水浮肿、支气管哮喘等病症。 别名：草麻黄，华麻黄，拉丁文名：Ephedra sinica Stapf，麻黄科、麻黄属草本植物，高20-40厘米；木质茎短或成匍匐状。有三种麻黄属的植物：草麻黄(Ephedra sinica)、木贼麻黄(Ephedra equisetina)与中麻黄(Ephedra intermedia)，为草本状灌木，采用部位为草质茎，也是重要的药用植物。生物碱含量丰富，是提取麻黄碱的主要资源。木质茎少，易加工提炼；由于常生于平原、山坡、河床、草原等处，故易于采收，因为麻黄的发汗力强，故外感风寒轻证、心悸、失眠、肺虚咳喘等均应忌用或慎用。老人、体虚及小儿宜用麻黄绒。中药中的发散风寒药（因为味道和颜色得名《本草纲目》说：“其味麻，其色黄”）'),
	(4, '桂枝', 'https://gss1.bdstatic.com/-vo3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=8eacfb349045d688a302b5a29cf91a23/2934349b033b5bb584bb12f934d3d539b600bc4c.jpg', '桂枝，别名：柳桂（学名：Cinnamomum cassia Presl）为樟科植物肉桂 Cinnamomum cassia Presl的干燥嫩枝。春、夏二季采收，除去叶，晒干，或切片晒干，本品呈长圆柱形，多分枝，长30～75cm，粗端直径0.3～1cm。表面红棕色至棕色，有纵棱线、细皱纹及小疙瘩状的叶痕、枝痕、芽痕，皮孔点状。质硬而脆，易折断。切片厚2～4mm，断面皮部红棕色，木部黄白色至浅黄棕色，髓部略呈方形。有特异香气，味甜、微辛，皮部味较浓。 [1] 主产于广西、广东及云南等地。春、夏季剪下嫩枝，晒干或阴干，切成薄片或小段用。'),
	(5, '生姜', 'https://gss3.bdstatic.com/-Po3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=550edd8975d98d1076d40b371904df33/8326cffc1e178a82c2d234d5ff03738da877e8dd.jpg', '生姜是姜科多年生草本植物姜（Zingiber officinale Roscoe）的新鲜根茎，高40～100cm。品种有：山东昌邑面姜、青州竹根姜 山农一号生姜 青州小黄姜。 别名有姜根、百辣云、勾装指、因地辛、炎凉小子、鲜生姜、蜜炙姜。姜的根茎（干姜）、栓皮（姜皮）、叶（姜叶）均可入药。生姜在中医药学里具有发散、止呕、止咳等功效。'),
	(6, '香薷', 'https://gss3.bdstatic.com/7Po3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=6a1e3b279925bc312b5d069e66e4ea8c/6f061d950a7b02083c1fd10862d9f2d3562cc801.jpg', '唇形科、香薷属植物， [1] 直立草本，密集的须根。茎通常自中部以上分枝，钝四稜形，具槽，无毛或被疏柔毛，常呈麦秆黄色，老时变紫褐色。叶卵形或椭圆状披针形，穗状花序，花梗纤细，近无毛，花萼钟形，花冠淡紫色，花丝无毛，花药紫黑色。花期7～10月。生于路旁、山坡、荒地、林内、河岸，海拔达3400米。 石香薷或江香薷干燥地上部分可入药，有发汗解表，化湿和中，利水消肿功效 [2] 。主治：夏月感寒饮冷，头痛发热，恶寒无汗，胸痞腹痛，呕吐腹泻，水肿，脚气。'),
	(7, '紫苏', 'https://gss2.bdstatic.com/9fo3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=9194b65f6ad9f2d3201123e991d7ed2e/810a19d8bc3eb135d99a3e05ae1ea8d3fd1f442b.jpg', '紫苏（学名：Perilla frutescens (L.) Britt. ），别名：桂荏、白苏、赤苏等；为唇形科一年生草本植物。具有特异的芳香，叶片多皱缩卷曲，完整者展平后呈卵圆形，长4至11厘米，宽2.5至9厘米，先端长尖或急尖，基部圆形或宽楔形，边缘具圆锯齿，两面紫色或上面绿色，下表面有多数凹点状腺鳞，叶柄长2至5厘米，紫色或紫绿色，质脆。嫩枝紫绿色，断面中部有髓，气清香，味微辛。 紫苏叶能散表寒，发汗力较强，用于风寒表症，见恶寒、发热、无汗等症，常配生姜同用；如表症兼有气滞，有可与香附、陈皮等同用。行气宽中紫苏叶用于脾胃气滞、胸闷、呕恶。紫苏叶是一种在中国南方湛江吴川地区广为使用的美味的调味品，人们常常用它的叶子来做菜，它的美味经常和蛤蒌相提并论。原产中国，主要分布于印度、缅甸、日本、朝鲜、韩国、印度尼西亚和俄罗斯等国家。中国华北、华中、华南、西南及台湾省均有野生种和栽培种。'),
	(8, '荆芥', 'https://gss3.bdstatic.com/-Po3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=0656e60ad539b6004dce08b1d16b5217/962bd40735fae6cd68114e880fb30f2443a70fb5.jpg', '荆芥（Nepeta cataria L.），别名：香荆荠、线荠、四棱杆蒿、假苏，是唇形科、荆芥属多年生植物。茎坚强，基部木质化，多分枝，高40-150厘米，基部近四棱形，上部钝四棱形，具浅槽，被白色短柔毛。入药用其干燥茎叶和花穗。鲜嫩芽小儿镇静最佳，荆芥叶黄绿色，茎方形微带紫色，横切面黄白色，穗子稍黑紫黄绿色。味平，性温，无毒，清香气浓。荆芥为发汗，解热药，是中华常用草药之一，能镇痰、祛风、凉血。治流行感冒，头疼寒热发汗，呕吐。'),
	(9, '薄荷', 'https://gss1.bdstatic.com/9vo3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=e5630ac58fb1cb133e693b15e56f3173/0bd162d9f2d3572cc014fdf68813632762d0c322.jpg', '薄荷，土名叫“银丹草”，为唇形科植物，即同属其他干燥全草。多生于山野湿地河旁，根茎横生地下，多生于2100米海拔高度，但也可在3500米海拔上生长，是一种有特种经济价值的芳香作物。 全株青气芳香。叶对生，花小淡紫色，唇形，花后结暗紫棕色的小粒果。 薄荷是中华常用中药之一。它是辛凉性发汗解热药，治流行性感冒、头疼、目赤、身热、咽喉、牙床肿痛等症。外用可治神经痛、皮肤瘙痒、皮疹和湿疹等。平常以薄荷代茶，清心明目。 光棚温室采摘的薄荷又是春节餐桌上的鲜菜。清爽可口。 在中国，薄荷主要以江苏、安徽两省产量最大。 薄荷栽种方式有根茎栽植、分株栽植和扦插繁殖三种。'),
	(10, '桑叶', 'https://gss0.bdstatic.com/-4o3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=21159b3dd739b6004dce08b1d16b5217/962bd40735fae6cd4f5233bf0db30f2443a70f0d.jpg', '桑叶，（Mulberry Leaf），学名：Folium Mori。中药名，是桑科植物桑的干燥叶，是蚕的日常食物，又名家桑、荆桑、桑椹树、黄桑叶等，我国南北各地广泛种植桑树，桑叶产量丰富。蚕的主要食物。完整叶片呈或宽卵形，叶片基部心脏形，顶端微尖，边缘有锯齿，叶脉密生白柔毛。老叶较厚暗绿色。嫩叶较薄，黄绿色。质脆易，握之扎手。气淡，味微苦涩。 药用一般认为霜后采者质佳。桑叶有疏散风热，清肺润燥，清肝明目的功效。且有治疗风热感冒，肺热燥咳，头晕头痛，目赤昏花的作用。到2014年，有人将桑叶的芽头做成了菜式，而使桑叶有了食疗的价值，因其桑叶的芽头营养价值丰富而被大众喜爱，称为桑芽菜。又以南浔辑里村，国丝文化园的桑树芽最为出众，考虑到穿珠湾水的灌溉，其桑叶芽的微量元素比一般桑芽的要高出很多。 [1] 桑椹儿果幼时青绿，成熟后呈黑紫色、紫红色，味酸甜可口。');
/*!40000 ALTER TABLE `herb` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
